<?php

$lang['required']                   = "Поле %s является обязательным.";
$lang['isset']                      = "Поле %s должно иметь значение.";
$lang['valid_email']                = "Поле %s должно содержать корректный адрес электронной почты.";
$lang['valid_emails']               = "Поле %s должно содержать все действительные адреса электронной почты.";
$lang['valid_url']                  = "Поле %s должно содержать корректный URL.";
$lang['valid_ip']                   = "Поле %s должно содержать корректный IP.";
$lang['min_length']                 = "Поле %s должно быть не менее %s символов в длину.";
$lang['max_length']                 = "Поле %s не может превышать %s символов в длину.";
$lang['exact_length']               = "Поле %s должно быть точно %s символов в длину.";
$lang['alpha']                      = "Поле %s может содержать только буквы алфавита.";
$lang['alpha_numeric']              = "Поле %s может содержать только алфавитно-цифровые символы.";
$lang['alpha_dash']                 = "Поле %s может содержать только алфавитно-цифровые символы, подчеркивания и тире.";
$lang['numeric']                    = "Поле %s должно содержать только цифры.";
$lang['is_numeric']                 = "Поле %s должно содержать только цифры.";
$lang['integer']                    = "Поле %s должно содержать целое число.";
$lang['regex_match']                = "Поле %s не в правильном формате.";
$lang['matches']                    = "Поле %s не соответствует полю %s.";
$lang['is_unique']                  = "Поле %s должно содержать уникальное значение.";
$lang['is_natural']                 = "Поле %s должно содержать только натуральные числа.";
$lang['is_natural_no_zero']         = "Поле %s имеет неправильное значение."; #"Поле %s должно содержать число больше нуля.";
$lang['decimal']                    = "Поле %s должно содержать десятичное число.";
$lang['less_than']                  = "Поле %s должно содержать число менее, чем в поле %s.";
$lang['greater_than']               = "Поле %s должно содержать число большее, чем в поле %s";

#USERS function

$lang['val_delivery_order']         = "Выберите тип доставки";
$lang['val_delivery_service_order'] = "Выберите службу доставки";
$lang['val_region_order']           = "Выберите область";
$lang['val_city_order']             = "Выберите город";
$lang['val_user_identity']          = "Данный телефон зарегистрирован";
$lang['val_user_identity_array']    = "Телефон %s зарегистрирован";
$lang['val_order_phone']            = "Данный телефон уже зарегистрирован";
$lang['val_order_phone_count']      = "На ваш аккаунт зарегистрировано максимальное количество телефонов. Используйте один из них.";

/* End of file form_validation_lang.php */
/* Location: ./system/language/english/form_validation_lang.php */